z800-with-windows-7.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>z800-with-windows-7</title>
<!-- 2017-06-16 금 16:12 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">z800-with-windows-7</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. z800 with windows 7</a>
<ul>
<li><a href="#sec-1-1">1.1. steps</a></li>
<li><a href="#sec-1-2">1.2. BIOS setting</a></li>
<li><a href="#sec-1-3">1.3. Driver download to thumb drive</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. msg</a></li>
<li><a href="#sec-1-3-2">1.3.2. dir</a></li>
<li><a href="#sec-1-3-3">1.3.3. dir &gt; sub</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> z800 with windows 7</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> steps</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>(opt)read 'BIOS setting'
</li>
<li>read 'Driver download to thumb drive'
</li>
<li>insert windows 7 cd then start installation
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> BIOS setting</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>F10 &gt; BIOS
</li>
<li>Storage &gt; Storage Options : 'RAID+AHCI'
</li>
<li>Advanced &gt; Device Options : 'SATA RAID Option ROM Download'
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Driver download to thumb drive</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li><a href="https://support.hp.com/in-en/drivers/selfservice/hp-z800-workstation/3718645">https://support.hp.com/in-en/drivers/selfservice/hp-z800-workstation/3718645</a>
</li>
<li>HP Z800 Workstation &gt; Windows 7(64-bit) &gt; Driver-Storage
</li>
<li>Intel Rapid Storage Technology Utlity and Driver 
for Microsoft Windows 7(64-bit Editions)
</li>
</ol>
</div>

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> msg</h4>
<div class="outline-text-4" id="text-1-3-1">
<pre class="example">
TITLE: Intel Rapid Storage Technology Utility and Driver for Microsoft Windows

VERSION: 11.5.4.1001 Rev. A
DESCRIPTION:
This package contains the Intel Rapid Storage Technology Enterprise Software, Utilities and Drivers for serial ATA (SATA) and SATA RAID drives in supported workstation models that are running a supported operating system. 

PURPOSE: Recommended
SOFTPAQ NUMBER: SP65105
CATEGORY: Driver - Storage
SSM SUPPORTED: Yes

ENHANCEMENTS: 
The following enhancement has been made in version 11.5.4.1001:
- Resolves a Windows Vista hang on shutdown with the security policy in place.

The following enhancement has been made in version 9.6.0.1014:
- Adds SSM support.
- Adds support for the Microsoft Windows 7 Ultimate Edition Operating System (32-bit).
- Provides an updated driver and utility release from Intel.

PREREQUISITES: 
None

INSTALLATION INSTRUCTIONS: 
TO INSTALL OR UPDATE THE INTEL RAPID STORAGE TECHNOLOGY UTILITY AND DRIVER ON EXISTING OPERATING SYSTEM INSTALLATIONS:

1. Download the file by clicking the "Download" or "Obtain Software" button and saving the file to a folder on your hard drive (make a note of the folder where the downloaded file is saved).

2. Double-click the downloaded file and follow the on-screen instructions.

3. The Intel Rapid Storage Technology installation utility starts automatically. Follow on-screen instructions to complete the installation.

TO USE THE INTEL RAPID STORAGE TECHNOLOGY DRIVER DURING A NEW OPERATING SYSTEM INSTALLATION:

1. Download the file by clicking the "Download" or "Obtain Software" button and saving the file to a folder on your hard drive (make a note of the folder where the downloaded file is saved).

2. Double-click the downloaded file and follow the on-screen instructions.

3. Navigate to C:\SWSETUP\SP65105 and unzip "f6flpy-x86.zip" to a diskette (floppy) or USB key for a 32-bit installation, or unzip "f6flpy-x64.zip" to a diskette (floppy) or USB key for a 64-bit installation.

4. Use the newly created driver installation media during operating system setup to install the drivers.


Copyright (c) 2014 Hewlett-Packard Development Company, L.P.
</pre>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> dir</h4>
<div class="outline-text-4" id="text-1-3-2">
<pre class="example">
C:\SWSETUP\SP65105&gt;dir
 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: E083-B4D4

 C:\SWSETUP\SP65105 디렉터리

2017-06-16  오후 03:25    &lt;DIR&gt;          .
2017-06-16  오후 03:25    &lt;DIR&gt;          ..
2012-10-26  오전 07:18           356,512 f6flpy-x64.zip
2012-10-26  오전 07:18           315,483 f6flpy-x86.zip
2012-10-26  오전 07:18        12,987,328 RST_11.5.4.1001_PV_Install.exe
2014-01-21  오전 10:35             4,653 sp65105.cva
               4개 파일          13,663,976 바이트
               2개 디렉터리  68,441,022,464 바이트 남음
</pre>
</div>
</div>

<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> dir &gt; sub</h4>
<div class="outline-text-4" id="text-1-3-3">
<pre class="example">
C:\SWSETUP\SP65105\f6flpy-x64&gt;dir
 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: E083-B4D4

 C:\SWSETUP\SP65105\f6flpy-x64 디렉터리

2017-06-16  오후 04:02    &lt;DIR&gt;          .
2017-06-16  오후 04:02    &lt;DIR&gt;          ..
2012-08-22  오전 03:41             9,017 iaAHCIC.cat
2012-08-16  오후 01:33            11,089 iaAHCIC.inf
2012-08-16  오후 01:33           645,952 iaStorA.sys
2012-08-22  오전 03:41             8,233 iaStorAC.cat
2012-08-16  오후 01:33             7,316 iaStorAC.inf
2012-08-16  오후 01:33            27,456 iaStorF.sys
               6개 파일             709,063 바이트
               2개 디렉터리  68,440,281,088 바이트 남음

C:\SWSETUP\SP65105\f6flpy-x64&gt;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-06-16 금 16:12</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
